/*
  String_ui.strings
  iina

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
// Common

"general.on" = "Zapnuté";
"general.off" = "Vypnuté";
"general.login" = "Prihlásenie";
"general.logout" = "Odhlásenie";
"general.ok" = "OK";
"general.cancel" = "Zrušiť";
"general.username" = "Meno používateľa";
"general.password" = "Heslo";
"general.na" = "N/A";

"input.value_is_empty" = "Hodnota nemôže byť prázdna.";
"input.already_exists" = "Hodnota už existuje.";

// Guide Window
"guide.highlights" = "Novinky";
"guide.basic_settings" = "Základné nastavenia";
"guide.faq" = "Často kladené otázky";

// Initial Window
"initial.announcement" = "Používate %@ beta verziu aplikácie IINA";
"initial.beta.desc" = "Odškrtnite \"Sťahovať beta aktualizácie\" v Nastavenia - Všeobecné a nainštalujte stabilnú verziu z našej <a href=\"https://iina.io\">oficiálnej stránky</a>.";
"initial.nightly.desc" = "
Nočné zostavy sa neodporúčajú používať ako denný ovládač. V súčasnosti nočné zostavy nepodporujú automatickú aktualizáciu. Nové zostavy si prosím stiahnite ručne z našej <a href=\"https://nightly.iina.io\">stránky s nočnými zostavami</a>.";
"initial.debug.desc" = "Ladiace zostavenie obvykle nie sú optimalizované pre výkon, nie sú teda odporúčané pre každodenné použitie. Ladiaci zostavenie nepodporujú automatické aktualizácie.";
"initial.bug_report" = "Nahláste na <a href=\"https://github.com/iina/iina/issues\">GitHub</a>.";

// Inspector Window
"inspector.error" = "Chyba";

// MainWindowController.swift
"main.buffering_indicator" = "Načítava sa… %d%%";
"main.opening_stream" = "Otváram stream…";
"main.seeking_indicator" = "Hľadám…";
"osc.precision" = "Presnosť";
"osc.1s" = "1 sekunda";
"osc.100ms" = "100 milisekúnd";
"osc.10ms" = "10 milisekúnd";
"osc.1ms" = "1 milisekunda";

// QuickSettingViewController.swift
"quicksetting.item_default" = "Predvolené";
"quicksetting.item_none" = "Žiadne";
"quicksetting.hwdec" = "Hardvérové dekódovanie";
"quicksetting.deinterlace" = "Deinterlace";
"quicksetting.hdr" = "HDR";
"quicksetting.hide" = "Skryť";
"quicksetting.reset_speed" = "Resetovať rýchlosť na 1x";

// EQ Presets
"eq.preset.flat" = "Plochá";
"eq.preset.acoustic" = "Akustická";
"eq.preset.classical" = "Klasická";
"eq.preset.dance" = "Tanečná";
"eq.preset.deep" = "Hlboká";
"eq.preset.electronic" = "Elektronická";
"eq.preset.hip_hop" = "Hip-Hop";
"eq.preset.increase_bass" = "Zvýšenie basov";
"eq.preset.increase_treble" = "Zvýšenie výšok";
"eq.preset.increase_vocal" = "Zvýšenie hlasu";
"eq.preset.jazz" = "Džez";
"eq.preset.latin" = "Latinčina";
"eq.preset.loundness" = "Hlasitosť";
"eq.preset.lounge" = "Salónik";
"eq.preset.piano" = "Klavírna";
"eq.preset.pop" = "Pop";
"eq.preset.rnb" = "R&B";
"eq.preset.reduce_bass" = "Zníženie basov";
"eq.preset.reduce_treble" = "Zníženie výšok";
"eq.preset.rock" = "Rock";
"eq.preset.small_speaker" = "Malý reproduktor ";
"eq.preset.spoken_word" = "Hovorové slovo";

"alert.eq.new_profile.title" = "Nový EQ profil";
"alert.eq.new_profile.message" = "Prosím, zadajte meno profilu.";
"alert.eq.rename.title" = "Premenovať Aktuálny Profil";
"alert.eq.rename.message" = "Zadajte nové meno profilu.";

// OSDMessage.swift
"osd.pause" = "Pozastaviť";
"osd.resume" = "Pokračovať";
"osd.volume" = "Hlasitosť: %@";
"osd.speed" = "Rýchlosť: %@x";
"osd.aspect" = "Pomer strán: %@";
"osd.crop" = "Orezať: %@";
"osd.rotate" = "Otočiť: %i°";
"osd.deinterlace" = "Deinterlace: %@";
"osd.hwdec" = "Hardvérové dekódovanie: %@";
"osd.audio_delay.nodelay" = "Posunutie zvuku: Žiadne";
"osd.audio_delay.later" = "Posunutie zvuku: +%@ s";
"osd.audio_delay.earlier" = "Posunutie zvuku: -%@ s";
"osd.sub_delay.nodelay" = "Posunutie titulkov: Žiadne";
"osd.sub_delay.later" = "Posunutie titulkov: +%@ s";
"osd.sub_delay.earlier" = "Posunutie titulkov: -%@ s";
"osd.subtitle_pos" = "Umiestnenie titulkov: %@";
"osd.sub_hidden" = "Skryté titulky";
"osd.sub_visible" = "Viditeľné titulky";
"osd.sub_second_delay.nodelay" = "Oneskorenie sekundárnych titulkov: bez oneskorenia";
"osd.sub_second_delay.later" = "Oneskorenie sekundárnych titulkov: %@s neskôr";
"osd.sub_second_delay.earlier" = "Posun sekundárnych titulkov: %@ s skôr";
"osd.sub_second_hidden" = "Skryté sekundárne titulky";
"osd.sub_second_pos" = "Secondary Subtitle Position: %@";
"osd.sub_second_visible" = "Viditeľné sekundárne titulky";
"osd.mute" = "Stlmiť";
"osd.unmute" = "Zosilniť";
"osd.screenshot" = "Snímka obrazovky vyhotovená";
"osd.abloop.a" = "AB-slučka: A";
"osd.abloop.b" = "AB-slučka: B";
"osd.abloop.clear" = "AB-slučka: Vymazaná";
"osd.stop" = "Zastaviť";
"osd.chapter" = "Kapitola: %@";
"osd.subtitle_scale" = "Veľkosť titulkov: %@x";
"osd.add_to_playlist" = "Súbory pridané do playlistu: %i";
"osd.clear_playlist" = "Playlist vymazaný";
"osd.video_eq.contrast" = "Kontrast: %i";
"osd.video_eq.gamma" = "Gama: %i";
"osd.video_eq.hue" = "Odtieň: %i";
"osd.video_eq.saturation" = "Saturácia: %i";
"osd.video_eq.brightness" = "Jas: %i";
"osd.find_online_sub" = "Hľadám titulky na internete…";
"osd.find_online_sub.source" = "na";
"osd.sub_not_found" = "Titulky nenájdené";
"osd.sub_found" = "Nájdených %d titulkov.";
"osd.sub_downloading" = "Sťahovanie %d titulkov";
"osd.sub_downloaded" = "Titulky stiahnuté";
"osd.sub_saved" = "Titulky uložené";
"osd.network_error" = "Problém so sieťou";
"osd.file_error" = "Chyba pri čítaní súboru";
"osd.cannot_login" = "Nie je možné prihlásiť";
"osd.canceled" = "Zrušené";
"osd.cannot_connect" = "Nie je možné sa pripojiť";
"osd.timed_out" = "Čas vypršal";
"osd.filter_added" = "Pridaný filter: %@";
"osd.filter_removed" = "Odstránený filter";
"osd.file_loop" = "Opakuj jeden súbor";
"osd.playlist_loop" = "Opakuj playlist";
"osd.no_loop" = "Zakázať opakovanie";

"preference.title" = "Nastavenia";
"preference.general" = "Všeobecné";
"preference.ui" = "UI";
"preference.video_audio" = "Video/Audio";
"preference.subtitle" = "Titulok";
"preference.network" = "Sieť";
"preference.control" = "Ovládanie";
"preference.keybindings" = "Klávesové skratky";
"preference.advanced" = "Pokročilé";
"preference.plugins" = "Pluginy";
"preference.utilities" = "Pomocné programy";
"preference.scripts" = "Skripty";
"preference.not_logged_in" = "Neprihlásený";
"preference.logged_in_as" = "Prihlásený ako %@";
"preference.system_media_control" = "Používať systémové multimediálne klávesy";

"preference.key_binding_hint_1" = "Na upravenie priradených kláves v aktuálnom konfiguračnom súbore najprv vytvorte kópiu kliknutím na \"Duplikovať…\".";
"preference.key_binding_hint_2" = "Dvakrát kliknite na riadok na pravej strane, aby ste upravili priradené klávesy.";

"preference.enable_adv_settings" = "Povoliť pokročilé nastavenia";

"preference.sub_override_level.no" = "nie";
"preference.sub_override_level.force" = "sila";
"preference.sub_override_level.scale" = "veľkosť";
"preference.sub_override_level.strip" = "Základný";
"preference.sub_override_level.yes" = "áno";

"preference.sub_override_level.descriptive_text.no" = "Vykresli titulky podľa špecifikácie skriptov titulkov bez prepísania.";
"preference.sub_override_level.descriptive_text.force" = "Použiť všetky štýly titulkov.";
"preference.sub_override_level.descriptive_text.scale" = "Okrem nastavení štýlu v tejto časti použite aj nastavenie mierky.";
"preference.sub_override_level.descriptive_text.strip" = "Radikálne odstráňte všetky značky a štýly ASS z nadpisu.";
"preference.sub_override_level.descriptive_text.yes" = "Použite všetky nastavenia štýlu v tejto časti.";

"preference.ytdl_plugin_not_installed" = "Nainštalujte si plugin Online Media z ponuky „Pluginy > Nainštalovať z GitHub“ a využívajte pokročilé funkcie, ako je napríklad sťahovanie videí a automatické aktualizácie yt-dlp.";
"preference.ytdl_plugin_installed" = "Vstavaná podpora youtube-dl je vypnutá, pretože máte nainštalovaný doplnok Online médiá.";

"menu.volume" = "Hlasitosť: %@";
"menu.volume_muted" = "Hlasitosť: %@ (stíšene)";
"menu.audio_delay" = "Posunutie zvuku: %@ s";
"menu.sub_delay" = "Posunutie titulkov: %@ s";
"menu.sub_hide" = "Skryť titulky";
"menu.sub_show" = "Zobraziť titulky";
"menu.sub_second_hide" = "Skryť sekundárne titulky";
"menu.sub_second_show" = "Zobraziť sekundárne titulky";
"menu.fullscreen" = "Spustiť režim celej obrazovky";
"menu.exit_fullscreen" = "Ukončiť režim celej obrazovky";
"menu.pip" = "Zapnúť Picture-in-Picture";
"menu.exit_pip" = "Vypnúť Picture-in-Picture";
"menu.mini_player" = "Zapnúť režim pre hudbu";
"menu.exit_mini_player" = "Ukončiť režim pre hudbu";
"menu.pause" = "Pozastaviť";
"menu.resume" = "Pokračovať";
"menu.speed" = "Rýchlosť: %@x";
"menu.chapters" = "Zobraziť panel s kapitolami";
"menu.hide_chapters" = "Skryť panel s kapitolami";
"menu.playlist" = "Zobraziť panel playlistu";
"menu.hide_playlist" = "Skryť panel playlistu";
"menu.video" = "Zobraziť panel videa";
"menu.hide_video" = "Skryť panel videa";
"menu.audio" = "Zobraziť panel audia";
"menu.hide_audio" = "Skryť panel audia";
"menu.subtitles" = "Zobraziť panel tituliek";
"menu.hide_subtitles" = "Skryť panel tituliek";

"menu.seek_forward" = "Posunúť dopredu %@ s";
"menu.seek_backward" = "Posunúť dozadu %@ s";
"menu.speed_up" = "Zrýchliť na %@x";
"menu.speed_down" = "Spomaliť na %@x";
"menu.volume_up" = "Hlasitosť +%@%%";
"menu.volume_down" = "Hlasitosť -%@%%";
"menu.audio_delay_up" = "Posunutie zvuku +%@ s";
"menu.audio_delay_down" = "Posunutie zvuku -%@ s";
"menu.sub_delay_up" = "Posunutie titulkov +%@ s";
"menu.sub_delay_down" = "Posunutie titulkov -%@ s";

"menu.crop_custom" = "Vlastné…";
"menu.find_online_sub" = "Nájsť titulky online na %@";

"menu.manage_plugins" = "Spravovať doplnky…";
"menu.developer_tool" = "Nástroje pre vývojárov";
"menu.more_plugin" = "Viac…";
"menu.conflicting_shortcuts" = "Konfliktné klávesové skratky…";
"menu.reload_plugins" = "Načítať všetky pluginy";
"menu.show_plugins_panel" = "Zobraziť Panel Doplnkov";
"menu.hide_plugins_panel" = "Skryť Panel Doplnkov";

"track.audio" = "Zvuk";
"track.none" = "<Prázdne>";
"track.sub" = "Titulok";
"track.video" = "Video";

"subtrack.no_loaded" = "Titulky nenačítané";
"subtrack.no_external" = "Externé titulky nenájdené";

// Alerts
"alert.beta_channel.title" = "Sťahovať aktualizácie pre beta verzie";

"alert.title_error" = "Chyba";
"alert.title_warning" = "Upozornenie";
"alert.title_info" = "Informácia";

"alert.fatal_error" = "Závažná chyba: %@ \nAplikácia sa teraz ukončí.";
"alert.mpv_error" = "Interná chyba %@ (%@) pri nastavení možnosti %@.";

"alert.unsupported_audio" = "Nepodporovaný externý zvukový súbor.";
"alert.unsupported_video" = "Unsupported external video file.";
"alert.unsupported_sub" = "Nepodporované externé titulky.";
"alert.unsupported_url" = "Nepodporované URL.";
"alert.wrong_url_format" = "Zlý formát URL.";

"alert.error_open" = "Nemožno otvoriť súbor alebo stream!";
"alert.error_finding_file" = "Nemožno nájst súbor %@!";
"alert.error_loading_script" = "Nemožno načítať skript %@!";
"alert.error_saving_file" = "Nastala chyba pri ukladaní %@: %@";
"alert.error_deleting_file" = "Súbor nemožno vymazať.";

"alert.target_peak.bad_value" = "Hodnota „%@“ je neplatná.\nProsím zadajte hodnotu medzi 10 a 10000 alebo 0.";

"alert.config.new.title" = "Nová konfigurácia vstupu";
"alert.config.new.message" = "Zadajte názov pre novú konfiguráciu.";
"alert.config.duplicate.title" = "Duplikovať konfiguráciu";
"alert.config.duplicate.message" = "Zadajte názov pre duplikovaný konfiguračný súbor.";
"alert.config.file_existing.title" = "Súbor už existuje";
"alert.config.file_existing.message" = "Konfiguračný súbor s rovnakým názvom už existuje. Zvoľte OK, aby sa súbor zobrazil v aplikácii Finder.";
"alert.config.cannot_create" = "Nedá sa vytvoriť konfiguračný súbor!\n%@";
"alert.config.cannot_write" = "Nedá sa zapisovať do konfiguračného súboru!";
"alert.config.rename.title" = "Premenovať konfigurácia vstupu";
"alert.config.rename.message" = "Zadajte názov pre novú konfiguráciu.";

"alert.filter.incorrect" = "Vyskytla sa chyba pri nastavovaní filtra. Skontrolujte formát parametra.";
"alert.add_filter.title" = "Nový filter";
"alert.add_filter.message" = "Zadajte reťazec filtru vo formáte mpv príkazu vf alebo af.";

"alert.keybinding_config.error" = "Chyba pri spracovaní konfiguračného súboru s klávesovými skratkami \"%@\"! Budú použité predvolené klávesové skratky. Skontrolujte vašu konfiguráciu.";

"alert.extra_option.cannot_read" = "Nemožno načítať mpv možnosti definované používateľom.";
"alert.extra_option.empty" = "Názov alebo hodnota nemôžu byť prázdne!";
"alert.extra_option.error" = "Chyba pri nastavovaní možnosti --%@=%@, číslo chyby %d. Skontrolujte vaše nastavenia v Nastavenia > Pokročilé.";
"alert.extra_option.config_folder" = "Chyba pri nastavovaní konfiguračného priečinka \"%@\".";

"alert.playlist.error_deleting" = "Chyba pri odstraňovaní: %@";

"alert.screenshot.error_taking" = "Nemôžem vytvoriť snímku obrazovky!";

"alert.sub.no_selected" = "Najprv vyberte stiahnuté titulky.";
"alert.sub_lang_not_set" = "Pred vyhľadávaním na OpenSubtitles nastavte v nastaveniach preferovaný jazyk titulkov. Teraz bude použitý jazyk English(eng).";
"alert.sub.cannot_save_passwd" = "Heslo sa nedá uložiť do Kľúčenky: %@";
"alert.sub.cannot_login" = "Nedá sa prihlásiť. Skontrolujte používateľské meno, heslo a stav siete. \n\n%@";
"alert.sub.save_downloaded.title" = "Uložiť stiahnuté titulky";

"alert.set_default.title" = "Nastaviť IINA ako predvolenú aplikáciu";
"alert.set_default.message" = "IINA bude nastavená ako predvolená aplikácia pre všetky typy súborov, ktoré podporuje.";
"alert.set_default.success" = "Dokončené s %d úspechom a %d chybami.";

"alert.add_watch.title" = "Pridať položku pozerať";
"alert.add_watch.message" = "Zadajte platný názov vlastnosti mpv.";

"alert.jump_to.title" = "Prejsť na";
"alert.jump_to.message" = "Zadajte čas, na ktorý chcete prejsť. Napríklad: 20:35";

"alert.opensub.login.title" = "Prihlásenie na OpenSubtitles";
"alert.opensub.login.message" = "Zadajte prihlasovacie meno a heslo";

"alert.open_url.title" = "Otvoriť URL";
"alert.open_url.message" = "Zadajte URL:";
"alert.choose_media_file.title" = "Vyberte súbory";

"alert.add_url.title" = "Pridať URL";
"alert.add_url.message" = "Zadajte URL:";

"alert.delete_history.title" = "Vymazať históriu prehrávania";
"alert.delete_history.message" = "Naozaj chcete vymazať vybrané položky?";

"alert.filter_hwdec.message" = "Práve chcete použiť video filter. Avšak, aktuálny hardvéroví dekodér nemusí podporovať video filtre. Môžete vypnúť hardvéroví dekodér alebo ho prepnúť na Auto(Kópia), ktoré dvojnásobne zaťaží pamäť. Môžete zopakovať predchádzajúcu úpravu (napr. orezanie), aby všetko fungovalo.";
"alert.filter_hwdec.abort" = "Prerušiť";
"alert.filter_hwdec.turn_off" = "Vypnúť hardvérové dekódovanie";
"alert.filter_hwdec.use_copy" = "Prepnúť na Auto(Copy)";

"alert.clear_cache.title" = "Vyčistiť vyrovnávaciu pamäť s náhľadmi";
"alert.clear_cache.message" = "Naozaj chcete vyčistiť vyrovnávaciu pamäť s náhľadmi?";

"alert.clear_history.title" = "Vymazať históriu prehrávania";
"alert.clear_history.message" = "Naozaj chcete vymazať celú históriu prehrávania?";

"alert.clear_watch_later.title" = "Vymazať uložené priebehy prehrávania";
"alert.clear_watch_later.message" = "Naozaj chcete vymazať všetky uložené priebehy prehrávania (dáta \"pozrieť neskôr\")?";

"alert.restore_alerts.title" = "Obnoviť potlačené upozornenia";
"alert.restore_alerts.message" = "Naozaj chcete obnoviť potlačené upozornenia?";

"alert.nothing_to_open" = "Žiaden súbor.";

"alert.no_video_track" = "Neobsahuje video stopu.";

"alert.duplicate_config" = "Predvolené konfigurácie nemožno priamo upraviť. Pred úpravami jednu konfiguráciu zduplikujte.";

"alert.assrt_register" = "Kvôli API limitom vám odporúčame použiť váš vlastný API token. Prednastavený token slúži iba na demo účeli a nemusí fungovať správne.";
"alert.assrt_register.register" = "Zaregistrovať sa";
"alert.assrt_register.try" = "Najprv Vyskúšajte";
"alert.assrt_token_prompt.title" = "Zadaj tvoj API token";
"alert.assrt_token_prompt.message" = "Zaregistrujte sa na otvorenej webstránke. Váš token z domovskej stránky vložte sem:";
"alert.assrt_token_invalid" = "Váš Assrt API token je neplatný.";

"alert.plugin_uninstall.title" = "Ste si istý, že chcete odinštalovať %@?";
"alert.plugin_uninstall.message" = "Doplnok bude odinštalovaný z disku.";
"alert.plugin_reinstall.title" = "Doplnok %@ už existuje";
"alert.plugin_reinstall.message" = "Chcete preinštalovať doplnok?";
"alert.duplicated_plugin_id" = "Detekované duplicitné identifikátory plug-inu. Dva alebo viac plug-inov majú rovnaký identifikátor „%@“. To môže spôsobiť neobvyklé správanie. Nájdite ich prosím v Nastavenia > Plug-iny a nahláste to ich autorom. Ak je plug-in nainštalovaný lokálne, môžete tiež manuálne zmeniť jeho identifikátor v súbore Info.json.";
"alert.plugin_no_update" = "Nenašli sa žiadne aktualizácie.";
"alert.plugin_update_found.title" = "Je dostupná nová verzia %@";
"alert.plugin_update_found.message" = "Najnovšia dostupná verzia je %@. Nainštalovaná je %@. Prajete si teraz stiahnuť aktualizáciu?";
"alert.plugin_permission" = "Tento plug-in vyžaduje nasledujúce oprávnenia. Pred pokračovaním vykonajte ich kontrolu.";
"alert.plugin_permission_added" = "Táto aktualizácia vyžaduje ďalšie oprávnenia. Pred pokračovaním vykonajte ich kontrolu.";

"playlist.total_length" = "%@ celkovo";
"playlist.total_length_with_selected" = "%@ z %@ označených";
"playlist.sorting.header" = "Sorting";
"playlist.sorting.filename_ascending" = "Filename Ascending";
"playlist.sorting.filename_descending" = "Filename Descending";
"playlist.sorting.path_ascending" = "File Path Ascending";
"playlist.sorting.path_descending" = "File Path Descending";
"pl_menu.title_multi" = "%d Položky";
"pl_menu.play_next" = "Prehraj Ďalšie";
"pl_menu.play_in_new_window" = "Prehraj v Novom Okne";
"pl_menu.remove" = "Vymazať";
"pl_menu.remove_multi" = "Vymazať Vybrané";
"pl_menu.delete" = "Presunúť do Koša";
"pl_menu.delete_multi" = "Presunúť Vybrané Súbory do Koša";
"pl_menu.delete_after_play" = "Presunúť do Koša po Prehraní";
"pl_menu.delete_after_play_multi" = "Presunúť Vybrané Súbory do Koša po Prehraní";
"pl_menu.show_in_finder" = "Zobraziť vo Finderi";
"pl_menu.add_file" = "Pridať Súbor…";
"pl_menu.add_url" = "Pridať URL…";
"pl_menu.clear_playlist" = "Vyčistiť Playlist";
"pl_menu.matched_sub" = "Zodpovedajúce %d Titulky";
"pl_menu.add_sub" = "Pridať Titulky…";
"pl_menu.wrong_sub" = "Nesprávne Titulky!";
"pl_menu.browser" = "Otvoriť vo Webovom Prehliadači";
"pl_menu.copy_url" = "Kopírovať URL";
"pl_menu.copy_url_multi" = "Kopírovať URLs";

"keymapping.title" = "Klávesové Skratky";
"keymapping.message" = "Stlač hociktorú klávesu pre zaznamenanie.";

"filter.video_filters" = "Video Filtre";
"filter.audio_filters" = "Zvukové Filtre";

"hwdec.no" = "Vypnúť Hardvérové Dekódovanie.";
"hwdec.auto" = "Zapnúť Hardvérové Dekódovanie. Avšak, väčšina video filtrov nebude fungovať.";
"hwdec.auto-copy" = "Zapnúť Hardvérové Dekódovanie. Dvojnásobne zaťažuje pamäť, ale video filtre budú fungovať.";

"gaplessAudio.no" = "Playback of consecutive audio files may result in silence or disruption at the point of file change.";
"gaplessAudio.weak" = "If the audio format the decoder output changes, the audio device is closed and reopened, disrupting gapless playback.";
"gaplessAudio.yes" = "The audio device is opened using parameters chosen for the first file played and is then kept open for gapless playback. Following files may be resampled.";

"subencoding.auto" = "Auto detekcia";

"osc_toolbar.settings" = "Rýchle Nastavenia";
"osc_toolbar.playlist" = "Playlist and kapitoly";
"osc_toolbar.pip" = "Prepnúť Picture-in-Picture";
"osc_toolbar.full_screen" = "Prepnúť zobrazenie na celú obrazovku";
"osc_toolbar.music_mode" = "Zapnúť režim pre hudbu";
"osc_toolbar.sub_track" = "Vyber titulky";
"osc_toolbar.screenshot" = "Vytvoriť snímku obrazovky";
"osc_toolbar.plugins" = "Zobraziť panel doplnkov";

"mini_player.album_art" = "Prepnúť obal albumu";
"mini_player.loop" = "Opakovať";
"mini_player.shuffle" = "Náhodne";
"mini_player.remove" = "Odstrániť z playlistu";
"mini_player.add" = "Pridať do playlistu";
"mini_player.delete" = "Odstrániť všetky skladby z playlistu";
"mini_player.volume" = "Hlasitosť";
"mini_player.close" = "Zavrieť mód pre hudbu";
"mini_player.back" = "Späť do video zobrazenia";
"mini_player.sort" = "Sort the playlist";

// Touch bar

"touchbar.ahead_15" = "15sec Dopredu";
"touchbar.ahead_30" = "30sec Dopredu";
"touchbar.back_15" = "15sec Dozadu";
"touchbar.back_30" = "30sec Dozadu";
"touchbar.next_video" = "Ďalšie Video";
"touchbar.prev_video" = "Predchádzajúce Video";
"touchbar.increase_volume" = "Hlasitosť +";
"touchbar.decrease_volume" = "Hlasitosť -";
"touchbar.rewind" = "Pretočiť";
"touchbar.fast_forward" = "Zrýchliť";
"touchbar.play_pause" = "Spustiť / Zastaviť";
"touchbar.seek" = "Vyhľadať";
"touchbar.time" = "Pozícia";
"touchbar.remainingTimeOrTotalDuration" = "Ostávajúci Čas / Celková Dĺžka";
"touchbar.toggle_pip" = "Zapnúť/Vypnúť Picture-in-Picture";

// Plugin permissions

"permissions.network-request.name" = "Sieťová Požiadavka";
"permissions.network-request.desc" = "Tento plugin môže prijímať alebo odosielať dáta na tieto webstránky:";
"permissions.network-request.any_site" = "Akákoľvek stránka";
"permissions.show-osd.name" = "Zozbraziť OSD";
"permissions.show-osd.desc" = "Tento plugin môže zobraziť OSD (On Screen Display = Displej Na Obrazovku) správy.";
"permissions.show-alert.name" = "Zobraziť upozornenie";
"permissions.show-alert.desc" = "Tento plug-in môže zobrazovať vyskakovacie upozornenie.";
"permissions.video-overlay.name" = "Pridať prekrytie cez video";
"permissions.video-overlay.desc" = "Tento plug-in môže vykresľovať cez video ďalší obsah.";
"permissions.file-system.name" = "Prístup k súborovému systému";
"permissions.file-system.desc" = "Tento plug-in môže čítať alebo zapisovať súbory na disk, vrátane citlivých informácií. Môže tiež využívať iné programy alebo aplikácie, ktoré môžu poškodiť váš počítač. Uistite sa teda, že ste overili jeho zdroj.";

"plugin.install" = "Inštalovať";
"plugin.installed" = "Nainštalované";
"plugin.not_installed" = "Nenainštalované";
"plugin.local" = "Nainštalované lokálne";
"alert.plugin.install_error" = "Pri inštalácii sa vyskytla chyba: %@";
"alert.invalid_url" = "URL je neplatná.";
"plugin.install_error.invalid_url" = "URL je neplatná.";
"plugin.install_error.file_not_found" = "Súbor balíčka sa nedá nájsť.";
"plugin.install_error.cannot_download" = "Sťahovanie plug-inu zlyhalo.\n\nVýstup:%@\n";
"plugin.install_error.cannot_unpackage" = "Rozbaľovanie plug-inu zlyhalo.\n\nVýstup:%@\n";
"plugin.install_error.cannot_load" = "IINA nemôže načítať tento plugin. Môže byť v chybnom formáte.";
"plugin.check_for_updates" = "Skontrolovať aktualizácie";
"plugin.updating" = "Sťahovanie aktualizácie…";
